app/Soap/Fedex/OpenShipService/OpenShip_v13/RetrieveOpenShipmentRequest_Reply.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/openship/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RetrieveOpenShipmentRequest>
         <v13:WebAuthenticationDetail>
            <v13:ParentCredential>
               <v13:Key>Input Your Information</v13:Key>
               <v13:Password>Input Your Information</v13:Password>
            </v13:ParentCredential>
            <v13:UserCredential>
               <v13:Key>Input Your Information</v13:Key>
               <v13:Password>Input Your Information</v13:Password>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber>Input Your Information</v13:AccountNumber>
            <v13:MeterNumber>Input Your Information</v13:MeterNumber>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>us</v13:LocaleCode>
            </v13:Localization>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RetrieveOpenShipmentRequest_v7</v13:CustomerTransactionId>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>us</v13:LocaleCode>
            </v13:Localization>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>ship</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:Index>Input Your Information</v13:Index>
      </v13:RetrieveOpenShipmentRequest>
   </soapenv:Body>
</soapenv:Envelope>

Out:

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <env:Header xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
   <soapenv:Body>
      <v13:RetrieveOpenShipmentReply xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:v13="http://fedex.com/ws/openship/v13">
         <v13:HighestSeverity>SUCCESS</v13:HighestSeverity>
         <v13:Notifications>
            <v13:Severity>SUCCESS</v13:Severity>
            <v13:Source>ship</v13:Source>
            <v13:Code>0000</v13:Code>
            <v13:Message>Success</v13:Message>
            <v13:LocalizedMessage>Success</v13:LocalizedMessage>
         </v13:Notifications>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RetrieveOpenShipmentRequest_v7</v13:CustomerTransactionId>
            <v13:Localization>
               <v13:LanguageCode>EN</v13:LanguageCode>
               <v13:LocaleCode>us</v13:LocaleCode>
            </v13:Localization>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>ship</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2014-05-23T09:30:47-05:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>INTERNATIONAL_PRIORITY</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:VariationOptions>
               <v13:Id>ISS</v13:Id>
               <v13:Values>SUPPORTED</v13:Values>
            </v13:VariationOptions>
            <v13:PreferredCurrency>USD</v13:PreferredCurrency>
            <v13:Shipper>
               <v13:AccountNumber>Input Your Information</v13:AccountNumber>
               <v13:Contact>
                  <v13:PersonName>Input Your Information</v13:PersonName>
                  <v13:CompanyName>Input Your Information</v13:CompanyName>
                  <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                  <v13:EMailAddress>Input Your Information</v13:EMailAddress>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:City>Memphis</v13:City>
                  <v13:StateOrProvinceCode>TN</v13:StateOrProvinceCode>
                  <v13:PostalCode>38118</v13:PostalCode>
                  <v13:CountryCode>US</v13:CountryCode>
                  <v13:Residential>false</v13:Residential>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:AccountNumber>Input Your Information</v13:AccountNumber>
               <v13:Contact>
                  <v13:PersonName>Input Your Information</v13:PersonName>
                  <v13:CompanyName>Input Your Information</v13:CompanyName>
                  <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Input Your Information</v13:StreetLines>
                  <v13:City>Richmond</v13:City>
                  <v13:StateOrProvinceCode>BC</v13:StateOrProvinceCode>
                  <v13:PostalCode>V7C4v5</v13:PostalCode>
                  <v13:CountryCode>CA</v13:CountryCode>
                  <v13:Residential>false</v13:Residential>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber>Input Your Information</v13:AccountNumber>
                     <v13:Contact>
                        <v13:PersonName>Input Your Information</v13:PersonName>
                        <v13:CompanyName>Input Your Information</v13:CompanyName>
                        <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                        <v13:EMailAddress>Input Your Information</v13:EMailAddress>
                     </v13:Contact>
                     <v13:Address>
                        <v13:StreetLines>Input Your Information</v13:StreetLines>
                        <v13:City>Memphis</v13:City>
                        <v13:StateOrProvinceCode>TN</v13:StateOrProvinceCode>
                        <v13:PostalCode>38118</v13:PostalCode>
                        <v13:CountryCode>US</v13:CountryCode>
                        <v13:Residential>false</v13:Residential>
                     </v13:Address>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:CustomsClearanceDetail>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber>Input Your Information</v13:AccountNumber>
                        <v13:Contact>
                           <v13:PersonName>Input Your Information</v13:PersonName>
                           <v13:CompanyName>Input Your Information</v13:CompanyName>
                           <v13:PhoneNumber>Input Your Information</v13:PhoneNumber>
                           <v13:EMailAddress>Input Your Information</v13:EMailAddress>
                        </v13:Contact>
                        <v13:Address>
                           <v13:StreetLines>Input Your Information</v13:StreetLines>
                           <v13:City>Memphis</v13:City>
                           <v13:StateOrProvinceCode>TN</v13:StateOrProvinceCode>
                           <v13:PostalCode>38118</v13:PostalCode>
                           <v13:CountryCode>US</v13:CountryCode>
                           <v13:Residential>false</v13:Residential>
                        </v13:Address>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>NON_DOCUMENTS</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>USD</v13:Currency>
                  <v13:Amount>2500.0</v13:Amount>
               </v13:CustomsValue>
               <v13:PartiesToTransactionAreRelated>false</v13:PartiesToTransactionAreRelated>
               <v13:CommercialInvoice>
                  <v13:TermsOfSale>DAP</v13:TermsOfSale>
               </v13:CommercialInvoice>
               <v13:Commodities>
                  <v13:NumberOfPieces>1</v13:NumberOfPieces>
                  <v13:Description>sdf</v13:Description>
                  <v13:CountryOfManufacture>US</v13:CountryOfManufacture>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>20.22</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>1.0</v13:Quantity>
                  <v13:QuantityUnits>cm</v13:QuantityUnits>
                  <v13:UnitPrice>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>45.0</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>USD</v13:Currency>
                     <v13:Amount>2500.0</v13:Amount>
                  </v13:CustomsValue>
               </v13:Commodities>
            </v13:CustomsClearanceDetail>
            <v13:BlockInsightVisibility>false</v13:BlockInsightVisibility>
            <v13:LabelSpecification>
               <v13:Dispositions>
                  <v13:DispositionType>STORED</v13:DispositionType>
               </v13:Dispositions>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_4X6</v13:LabelStockType>
               <v13:LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</v13:LabelPrintingOrientation>
            </v13:LabelSpecification>
            <v13:RateRequestTypes>LIST</v13:RateRequestTypes>
            <v13:PackageCount>6</v13:PackageCount>
         </v13:RequestedShipment>
      </v13:RetrieveOpenShipmentReply>
   </soapenv:Body>
</soapenv:Envelope>